[
    {
        "id": "1",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "INCOME-DRIVEN STUDENT LOAN REPAYMENT PLANS HAS BEEN SUSPENDED",
        "media": "https://plus.unsplash.com/premium_photo-1677678989485-c06237b623f3?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "content": "The US Department of Education has stopped accepting applications for all income-driven repayment (IDR) plans for federal student loans. This decision follows a court ruling that expanded an injunction against the Biden administration's SAVE plan, which was designed to adjust payments based on borrowers' income and family size.\n\nIDR plans, including Income-Based Repayment, Income-Contingent Repayment, Pay As You Earn, and the SAVE plan, help borrowers manage payments and offer loan forgiveness after 20 or 25 years. The suspension comes amid staffing shortages, technical challenges, and broader policy changes affecting the Department.\n\nWhat are your thoughts?",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },
    {
        "id": "2",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Mike White reveals surprising ‘White Lotus’ coupling that ended up on the cutting room floor",
        "media": "https://media.cnn.com/api/v1/images/stellar/prod/20250407-zion-piper-split.jpg?q=w_1160,c_fill/f_webp",
        "content": "Mike White, the mastermind behind “The White Lotus,” had even more to pack into the just-concluded third season, but he says some juicy things had to be cut from the 90-minute finale.\n\nIn the companion podcast to the buzzy series, White – the show’s creator, writer, director and executive producer – revealed that Piper’s (Sarah Catherine Hook) story had to be thinned considerably, including a fling she has with Zion (Nicholas Duvernay), which White said was “very disappointing.”\n\nWhite said the sequence would have added 10 minutes to the finale and tonally felt like a mismatch to have “a rom-com vibe in the middle of trying to kill the family with the pong pong fruits.”",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },
    {
        "id": "3",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Battle lines over Trump agenda intensify and put GOP leaders in a jam",
        "media": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208885949.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
        "content": "Speaker Mike Johnson has relied on one strategy so far in his chaotic GOP House: Survive and advance.\n\nWith the first 100 days of the GOP Congress now behind him, Johnson is heading into a much bigger battle, this time over far thornier details of President Donald Trump’s legislative agenda. But after Johnson’s public vow that the final bill would contain at least $1.5 trillion in spending cuts — all without adding to the deficit and making Trump’s tax cuts permanent — some Republicans told CNN they’re not sure how Johnson gets through this next and most consequential round.",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },{
        "id": "4",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Stay motivated to work out by using mottos or mantras",
        "media": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSVtGOgTfKI4pDunbHYvA-nfPtpU7Usszc_Z_H4gWFE4rs5b-0l0148yTA4hQGu4CdApSs&usqp=CAU",
        "content": "The winter flu season is still in full force, according to the US Centers for Disease Control and Prevention, causing many sufferers to halt their exercise regimen. But not every illness requires you to set down your gym bag. While moderate to severe ailments require a certain amount of rest and recovery, mild illnesses may improve with movement.\n\n“To be totally inactive and bedridden has a negative impact on your immune system, energy levels and recovery ability,” said Walter Gjergja, cofounder of the fitness app Zing Coach who is based in Lugano, Switzerland. “It’s usually beneficial to have some activity, although of the appropriate quantity and quality.”",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },
    {
        "id": "5",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "How to boost protein in your diet, without losing other nutrients. 5 tips from an expert",
        "media": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1333538957.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
        "content": "Americans are in the middle of a love-affair with protein.\n\nA stroll through almost any major supermarket — where food labels tout grams of protein — bears witness to the trend.\n\nThe US recommended dietary allowance (RDA) of protein for adults 18 and older is 0.8 grams per kilogram of body weight (or 0.36 grams per pound) per day, which translates to about 54 grams of protein for a 150-pound person, or 72 grams for someone weighing 200 pounds. Established jointly by the US Department of Agriculture and the US Department of Health and Human Services, the RDA represents the minimum amount of protein that must be eaten by a relatively sedentary person to meet the basic needs of their body.",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },{
        "id": "6",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Technology use may be associated with a lower risk for dementia, study finds",
        "media": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1254621518.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
        "content": "With the first generation of people exposed widely to technology now approaching old age, how has its use affected their risk of cognitive decline?\n\nThat’s a question researchers from two Texas universities sought to answer in a new meta-analysis study, a review of previous studies, published Monday in the journal Nature Human Behavior. The query investigates the “digital dementia hypothesis,” which argues that lifetime use may increase reliance on technology and weaken cognitive abilities over time.\n\n“We say a really active brain in youth and midlife is a brain that is more resilient later,” said Dr. Amit Sachdev, medical director of the department of neurology and ophthalmology at Michigan State University, who wasn’t involved in the study.",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },
    {
        "id": "7",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Google faces $6.6 billion lawsuit in Britain for alleged abuse of dominance in online search",
        "media": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1962547509.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
        "content": "Google is being sued in Britain for potential damages of up to £5 billion ($6.6 billion) in a class action alleging the company abused its dominant market position in online search.\n\nThe class action, filed at the Competition Appeal Tribunal Tuesday, argues that Google’s actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.\n\nIt said the US company, owned by Alphabet (GOOGL), contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },
    {
        "id": "8",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Nigerian cinema in the spotlight as ‘My Father’s Shadow’ to premiere in Cannes Film Festival first",
        "media": "https://media.cnn.com/api/v1/images/stellar/prod/mfs-composite.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
        "content": "Nigeria is going to Cannes. In what is understood﻿ to be a first in the film festival’s near-80 year history, a movie from Africa’s most populous nation has been chosen as part of the Cannes Film Festival’s Official Selection.\n\n“My Father’s Shadow,” directed by Akinola Davies Jr. and co-written with his brother, writer Wale Davies, stars Ṣọpẹ́ Dìrísù (“Slow Horses,” “Gangs of London”). The film is set in Lagos in the aftermath of the 1993 presidential election and follows Dìrísù’s father and two sons Remi and Akin, as they attempt an odyssey across the city amid the election’s turbulent fallout.\n\n“My Father’s Shadow,” directed by Akinola Davies Jr. and co-written with his brother, writer Wale Davies, stars Ṣọpẹ́ Dìrísù (“Slow Horses,” “Gangs of London”). The film is set in Lagos in the aftermath of the 1993 presidential election and follows Dìrísù’s father and two sons Remi and Akin, as they attempt an odyssey across the city amid the election’s turbulent fallout.",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },{
        "id": "9",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Hermès overtakes LVMH to become the world’s most valuable luxury company",
        "media": "https://plus.unsplash.com/premium_photo-1677678989485-c06237b623f3?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "content": "<b>Paris, France Reuters</b> — LVMH lost its position on Tuesday as Europe’s largest luxury company in terms of market capitalization after being overtaken by rival Hermès due to investor pessimism after disappointing first-quarter revenue from the sector bellwether. \n\nLVMH, whose high-end brands include Louis Vuitton and Dior, jewelry brand Tiffany & Co. and beauty chain Sephora, missed expectations for first-quarter sales as US shoppers curbed purchases of beauty products and cognac while sales in China remained weak.\n\nLVMH shares dropped 7%, bringing its market capitalization down to €246 billion, compared to €247 billion for Hermès.",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    },
    {
        "id": "10",
        "user": {
            "name": "Sandrine",
            "handle": "@sandrinetweets",
            "avatar": "https://i.pravatar.cc/150?img=1"
        },
        "title": "Vatican puts Sagrada Família architect on the path to sainthood",
        "media": "https://plus.unsplash.com/premium_photo-1677678989485-c06237b623f3?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "content": "<b>CNN</b> — Antoni Gaudí, the celebrated Catalan long nicknamed “God’s architect” for designing Barcelona’s Sagrada Família, has been put on the path to sainthood by the Vatican.\n\nIn a statement released on Monday, the Vatican said Pope Francis recognized Gaudí’s “heroic virtues,” which is a step on the path to sainthood.\n\nBecoming a saint is a complex process that can take hundreds of years, however, since a candidate normally needs two miracles to be attributed to their intercession.\n\nFinding those miracles will be the next step if Gaudí is to beatified and then canonized. Commissions of doctors and theologians then examine the miracles before the pope makes the ultimate decision to canonize someone.\n\nGaudí is a rare case. Few artists become saints and no architect, in the modern understanding of the profession, has ever been canonized.",
        "timestamp": 5,
        "commentsCount": 120,
        "sentiment": {
            "positive": 10,
            "neutral": 30,
            "negative": 60
        }
    }
]